---
kind: method
id: M:Autodesk.Revit.DB.DefinitionGroups.Contains(Autodesk.Revit.DB.DefinitionGroup)
source: html/a7892e7a-2ebb-6f39-7c64-f63cf9c1414b.htm
---
# Autodesk.Revit.DB.DefinitionGroups.Contains Method

Tests for the existence of a definition group within the collection.

## Syntax (C#)
```csharp
public bool Contains(
	DefinitionGroup definitionGroup
)
```

## Parameters
- **definitionGroup** (`Autodesk.Revit.DB.DefinitionGroup`) - The definition group to look for.

## Returns
True if the definition group was found, false otherwise.